#include <iostream>
// Функция быстрого возведения в степень (итеративный метод)
long long power_iter(long long a, long long n) {
    long long res = 1; // Итоговый результат, начинаем с 1 (нейтральный элемент умножения)

    // Пока степень больше нуля, продолжаем вычисления
    while (n > 0) {
        // Проверяем: если степень нечетная (остаток от деления на 2 равен 1)
        // Значит, текущий бит в двоичном представлении n равен 1
        // Мы обязаны учесть это основание в итоговом результате
        if (n % 2 == 1) {
            res *= a; 
        }
        //след степ двойки (a^2, a^4, a^8 и т.д.)
        a *= a; 
        
        // Делим степень на 2 (целочисленное деление отбрасывает остаток)
        // Это равносильно сдвигу числа вправо в двоичной системе, мы "откусываем" младший бит
        n /= 2; 
    }

    // Возвращаем полученный результат
    return res; 
}

int main() {
    // Вызываем функцию и выводим результат (10 в 12 степени)
    std::cout << power_iter(10, 12) << std::endl; 
    return 0;
}